#Задача 8: анализ заказов
"""
Использование множеств для анализа материалов трех подрядчиков
"""
#Создание списков
# Подрядчик №1
contractor_1 = ["Древесина", "Сталь", "Бетон", "Пластик", "Стекло"]
# Подрядчик №2
contractor_2 = ["Сталь", "Алюминий", "Бетон", "Резина", "Стекло"]
# Подрядчик №3
contractor_3 = ["Древесина", "Бетон", "Стекло", "Глина", "Медь"]

"""
Преобразуем списки в множества для удобной работы с операциями
"""
set_1 = set(contractor_1)
set_2 = set(contractor_2)
set_3 = set(contractor_3)

